tutorials/cfdemSolverPimple/bubblingFluidizedBed_NoSmoothing/CFD/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    ( 0.044  0.0000 0.0 )
    ( 0.0000  0.0000 0.0 )
    ( 0.0000  0.0100 0.0 )
    ( 0.044  0.0100 0.0 )

    ( 0.044  0.0000  0.500 )
    ( 0.0000  0.0000  0.500 )
    ( 0.0000  0.0100  0.500 )
    ( 0.044  0.0100  0.500 )
);

blocks
(
    hex (1 0 3 2 5 4 7 6) (36 8 330) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 7 6 5)
        );
    }

    wall
    {
        type wall;
        faces
        (
            (1 0 4 5)
            (0 3 7 4)
            (3 2 6 7)
            (2 1 5 6)
        );
    }
);

// ************************************************************************* //
